
## Plan Result (prod)




<pre><code>Plan: 10 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_api_management_subscription.bulk_scan_team_subscription
  * azurerm_api_management_subscription.exela_supplier_subscription
  * azurerm_api_management_subscription.iron_mountain_supplier_subscription
  * azurerm_key_vault_secret.bulk_scan_team_subscription_key
  * azurerm_key_vault_secret.exela_supplier_subscription_key
  * azurerm_key_vault_secret.iron_mountain_supplier_subscription_key
  * module.cft_api_mgmt.azurerm_api_management_api.api
  * module.cft_api_mgmt.azurerm_api_management_product_api.link_to_product[0]
  * module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy
  * module.cft_api_mgmt_product.azurerm_api_management_product.product
* Update
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;USER&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.bulk_scan_team_subscription will be created
  + resource "azurerm_api_management_subscription" "bulk_scan_team_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-prod"
      + display_name        = "Blob Router API - Bulk Scan DTS Team Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "cft-prod-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_api_management_subscription.exela_supplier_subscription will be created
  + resource "azurerm_api_management_subscription" "exela_supplier_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-prod"
      + display_name        = "Blob Router API - Exela Supplier Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "cft-prod-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_api_management_subscription.iron_mountain_supplier_subscription will be created
  + resource "azurerm_api_management_subscription" "iron_mountain_supplier_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-prod"
      + display_name        = "Blob Router API - Iron Mountain Supplier Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "cft-prod-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_key_vault_secret.bulk_scan_team_subscription_key will be created
  + resource "azurerm_key_vault_secret" "bulk_scan_team_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod"
      + name                    = "bulk-scan-team-cft-apim-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.exela_supplier_subscription_key will be created
  + resource "azurerm_key_vault_secret" "exela_supplier_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod"
      + name                    = "exela-cft-apim-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-06-06T07:24:54Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-DATABASE/8fcfcc7568314980a0d149fde7581330"
        name                    = "blob-router-POSTGRES-DATABASE"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-06-06T07:24:54Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-HOST/ed980219a91e4a53a32550c8b91bdffb"
        name                    = "blob-router-POSTGRES-HOST"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-06-06T07:24:54Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-PASS/8eb8d92035ca4a98b659a9592856d9a7"
        name                    = "blob-router-POSTGRES-PASS"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-06-06T07:24:54Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-PORT/625ba64f902c483f8454541197005db0"
        name                    = "blob-router-POSTGRES-PORT"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-06-06T07:24:54Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-USER/3ee7881662a042839db61e23d65df6bb"
        name                    = "blob-router-POSTGRES-USER"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.iron_mountain_supplier_subscription_key will be created
  + resource "azurerm_key_vault_secret" "iron_mountain_supplier_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod"
      + name                    = "iron-mountain-cft-apim-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.cft_api_mgmt.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "cft-api-mgmt-prod"
      + api_type              = "http"
      + display_name          = "Blob Router API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "blob-router-api"
      + path                  = "reform-scan"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "cft-prod-network-rg"
      + revision              = "1"
      + service_url           = "http://reform-scan-blob-router-prod.service.core-compute-prod.internal"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://hmcts.github.io/cnp-api-docs/specs/blob-router-service.json"
        }
    }

  # module.cft_api_mgmt.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "cft-api-mgmt-prod"
      + api_name            = "blob-router-api"
      + id                  = (known after apply)
      + product_id          = "blob-router"
      + resource_group_name = "cft-prod-network-rg"
    }

  # module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "cft-api-mgmt-prod"
      + api_name            = "blob-router-api"
      + id                  = (known after apply)
      + resource_group_name = "cft-prod-network-rg"
      + xml_content         = <<-EOT
            <policies>
              <backend>
                <base/>
              </backend>
              <inbound>
                <base/>
                <choose>
                  <when condition="@(context.Request.Certificate == null)" >
                    <return-response>
                      <set-status code="401" />
                      <set-body>Missing client certificate</set-body>
                    </return-response>
                  </when>
                  <when condition="@(context.Request.Certificate.NotAfter &lt; DateTime.Now || context.Request.Certificate.NotBefore &gt; DateTime.Now || !(new string[] {&quot;284A5A1DC75748A657D18FE77A666B0291974289&quot;,&quot;D593AF43215C219EEA637A851F55FC9C03EE4A00&quot;,&quot;41B0BA6FF84CE7BDB1F7864BC9248CFBF107B54E&quot;,&quot;CC852B5D1349041E1309AC5F9918ECE1FE5C023C&quot;}.Any(c => c == context.Request.Certificate.Thumbprint)))" >
                    <return-response>
                      <set-status code="401" />
                      <set-body>Invalid client certificate</set-body>
                    </return-response>
                  </when>
                  <!-- Reconciliation endpoint -->
                  <when condition="@(context.Request.Url.Path.Contains(&quot;reconciliation-report&quot;))">
                    <send-request mode="new" response-variable-name="apiKeySecret" timeout="20" ignore-error="false">
                      <set-url>https://reform-scan-{{environment}}.vault.azure.net/secrets/reconciliation-api-key/?api-version=7.0</set-url>
                      <set-method>GET</set-method>
                      <authentication-managed-identity resource="https://vault.azure.net" />
                    </send-request>
                    <!-- transform keyvault secret response to string -->
                    <set-variable name="apiKeySecretResponse" value="@{
                            var secret = ((IResponse)context.Variables[&quot;apiKeySecret&quot;]).Body.As<JObject>();
                            return secret[&quot;value&quot;].ToString();
                        }" />
                    <!-- Set Apikey with Bearer as Authorization header -->
                    <set-header name="Authorization" exists-action="override">
                      <value>@("Bearer " + (string)context.Variables["apiKeySecretResponse"])</value>
                    </set-header>
                  </when>
                </choose>
              </inbound>
              <outbound>
                <base/>
              </outbound>
              <on-error>
                <base/>
              </on-error>
            </policies>
        EOT
    }

  # module.cft_api_mgmt_product.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "cft-api-mgmt-prod"
      + approval_required     = false
      + display_name          = "blob-router"
      + id                    = (known after apply)
      + product_id            = "blob-router"
      + published             = true
      + resource_group_name   = "cft-prod-network-rg"
      + subscription_required = true
      + subscriptions_limit   = 20
    }

Plan: 10 to add, 5 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2226,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->